app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses`
---
  def index
    @courses = Course.includes(:contents).all

INSERT INTO "courses" ("name", "price", "info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Computing"], ["price", 0.0], ["info", "Everything to do with computing"], ["created_at", 2017-04-19 01:37:49 UTC], ["updated_at", 2017-04-19 01:37:49 UTC]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "price" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["price", 40.0], ["updated_at", 2017-04-19 01:38:01 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)